MezEmacs.org
#+title: MezEmacs configuration
# #+PROPERTY: header-args:emacs-lisp :tangle "./MezEmacs.el" :mkdirp [yes]
* MezEmacs configuration
** Startup configs
- This is the basic config that everyone puts on emacs to make mor clear.
#+begin_src emacs-lisp :tangle yes
  (setq custom-file (concat user-emacs-directory "./configs/custom_2.el"))
  (when (file-exists-p custom-file)
    (load custom-file))

  (setq custom-config "./configs/custom_2.el")
    (setq inhibit-startup-message t)
    (setq visual-line-mode t)
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (menu-bar-mode -1)
    (setq visible-bell 1)
    (global-display-line-numbers-mode)
    (setq display-line-numbers-type 'relative)

    (electric-pair-mode t)
    (setq-default indent-tabs-mode t)

    (defalias 'yes-or-no-p 'y-or-n-p)

    (prefer-coding-system 'utf-8)

#+end_src
- Font config
  #+begin_src emacs-lisp :tangle yes
    (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 140)
    (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 140)
    (set-face-attribute 'variable-pitch nil :font "FiraCode Nerd Font" :height 140)
  #+end_src
** My TMNT(Teenage Mutant Ninja Turtles) color Theme:
- The definiton of my TMNT color theme
  #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/tmnt_theme_color_2.el" :mkdirp yes
    ;; Set the color theme for the Teenage Mutant Ninja Turtles
    (custom-set-faces
     '(default ((t (:background "#2d3339" :foreground "#9966cc"))))
     '(font-lock-comment-face ((t (:foreground "#b9b9b9"))))
     '(font-lock-comment-delimiter-face ((t (:foreground "#b9b9b9"))))
     '(font-lock-string-face ((t (:foreground "#e6a75e"))))
     '(font-lock-function-name-face ((t (:foreground "#82b47d"))))
     '(font-lock-variable-name-face ((t (:foreground "#6fb4d6"))))
     '(font-lock-keyword-face ((t (:foreground "#b94d8b"))))
     '(font-lock-type-face ((t (:foreground "#c3c080"))))
     '(font-lock-constant-face ((t (:foreground "#e58d62"))))
     '(font-lock-builtin-face ((t (:foreground "#e58d62"))))
     `(flycheck-warning ((t (:underline (:style wave :color "#FFD300")))))
     `(flycheck-error ((t (:underline (:style wave :color "#FF4500")))))
     ;; `(region ((t (:background "#3d3d3d" :foreground "#FFFFFF"))))
     ;; `(cursor ((t (:background "#FFFFFF"))))
     `(line-number ((t (:foreground "#FFA500"))))
     `(line-number-current-line ((t (:foreground "#00FF7F"
                                                 :background "#1d1f21"))))
     )

    ;; make cursor blink
    (defvar blink-cursor-colors (list  "#92c48f" "#6785c5" "#be369c" "#d9ca65")
      "On each blink the cursor will cycle to the next color in this list.")

    (setq blink-cursor-count 0)
    (defun blink-cursor-timer-function ()
      "Zarza wrote this cyberpunk variant of timer `blink-cursor-timer'. 
        Warning: overwrites original version in `frame.el'.

        This one changes the cursor color on each blink. Define colors in `blink-cursor-colors'."
      (when (not (internal-show-cursor-p))
        (when (>= blink-cursor-count (length blink-cursor-colors))
          (setq blink-cursor-count 0))
        (set-cursor-color (nth blink-cursor-count blink-cursor-colors))
        (setq blink-cursor-count (+ 1 blink-cursor-count))
        )
      (internal-show-cursor nil (not (internal-show-cursor-p)))
      )
    ;; (global-hl-line-mode)
    ;; (set-face-background 'hl-line "#301934")
    (global-hl-line-mode)
    (set-face-background 'hl-line "#301934")
    (set-face-attribute 'hl-line nil :box '(:line-width 3 :color "purple"))
    ;; Set background color for active modeline
    (set-face-background 'mode-line "#301934")
    ;; Set box attribute for active modeline
    (set-face-attribute 'mode-line nil :box '(:line-width 3 :color "purple"))
    ;; Set background color for inactive modeline
    (set-face-background 'mode-line-inactive "#301934")
    ;; Set box attribute for inactive modeline
    (set-face-attribute 'mode-line-inactive nil :box '(:line-width 3 :color "purple"))

    ;;; add purple border to the window
    (set-face-attribute 'vertical-border nil :foreground "purple")
    (set-face-attribute 'window-divider nil :foreground "purple" :background "purple")
    (set-face-attribute 'window-divider-first-pixel nil :foreground "purple" :background "purple")
    (set-face-attribute 'window-divider-last-pixel nil :foreground "purple" :background "purple")

  #+end_src
- Now we import to the config file
  #+begin_src emacs-lisp :tangle yes
    (load-file "~/.emacs.d/configs/tmnt_theme_color_2.el")
  #+end_src
** Config the repositorys for download the packages
- List of repositorys that we take our packages, and the basic package to config all the other packages
#+begin_src emacs-lisp :tangle yes
;; Initialize package sources
    (require 'package)

    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			    ("org" . "https://orgmode.org/elpa/")
			    ("elpa" . "https://elpa.gnu.org/packages/")))

    (package-initialize)
    (unless package-archive-contents
    (package-refresh-contents))
#+end_src
** Config General:
- General is a package that helps create and redefine keybinds
  #+begin_src emacs-lisp :tangle yes
    (use-package general
    :ensure t
      :config
      (general-create-definer rune/leader-keys
	:keymaps '(normal insert visual emacs)
	:prefix "SPC"
	:global-prefix "C-SPC")
      (rune/leader-keys
	"t" '(:ignore t :which-key "toggles")
	))
  #+end_src
** Config evil and the adjacent packages
- Config evil and the adjacent packages:
  - Evil:
    - Is a package that brings Vi functionalities to emacs
    #+begin_src emacs-lisp :tangle yes
    (use-package evil
        :demand t
        :bind (("<escape>" . keyboard-escape-quit))
        :init
        (setq evil-want-keybinding nil)
        :config
        (evil-mode 1))
    #+end_src
  - Evil colection:
    - Is a package to "upgrade" evil package that has alot of configs to popular packages
      #+begin_src emacs-lisp :tangle yes
        (use-package evil-collection
        :after evil
        :config
        (setq evil-want-integration t)
        (evil-collection-init))
      #+end_src
** config Company mode:
- Company is an auto-complete packages that suggests completions based on the file and file type you are editing.
  #+begin_src emacs-lisp :tangle yes
(use-package company
  :ensure t
  :init (global-company-mode)
  :config
  (setq company-selection-wrap-around t)
  (setq company-idle-delay 0.60)
  (setq company-minimum-prefix-length 1)
  (setq company-require-match nil)
  (setq company-tooltip-align-annotations t)
  (setq company-tooltip-flip-when-above t)
  (setq company-tooltip-limit 10)
  (setq company-tooltip-minimum-width 50)
  (setq company-tooltip-minimum-height 10)
  (setq company-dabbrev-downcase nil))

(defun my-company-tab-or-complete ()
  (interactive)
  (if (eq last-command 'company-complete-selection)
      (company-complete-selection)
    (if (eq company-common (car company-candidates))
        (company-complete-selection)
      (company-select-next))))

(defun my-company-backtab-or-complete ()
  (interactive)
  (if (eq last-command 'company-complete-selection)
      (company-complete-selection)
    (if (eq company-common (car (last company-candidates)))
        (company-complete-selection)
      (company-select-previous))))

(define-key company-active-map (kbd "TAB") 'my-company-tab-or-complete)
(define-key company-active-map (kbd "<tab>") 'my-company-tab-or-complete)
(define-key company-active-map (kbd "S-TAB") 'my-company-backtab-or-complete)
(define-key company-active-map (kbd "<backtab>") 'my-company-backtab-or-complete)

(use-package company-quickhelp
  :ensure t
  :after company
  :config
  (company-quickhelp-mode 1))

(defun my-disable-company-mode-in-python ()
  "Desativa o Company Mode no modo Python."
  (when (eq major-mode 'python-mode)
    (company-mode -1))
  (when (not (eq major-mode 'python-mode))
    (company-mode 1)))

(add-hook 'after-change-major-mode-hook 'my-disable-company-mode-in-python)
  #+end_src
** Garbage collection
#+begin_src emacs-lisp :tangle yes
  ;; (setq gc-cons-threshold most-positive-fixnum)
  ;; (add-hook 'emacs-startup-hook
  ;;           (lambda ()
  ;;             (setq gc-cons-threshold (expt 2 23)))
#+end_src
** Config Dashboard:
- Dashboard is a package that added a startup buffer
  #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/dashboard_config_2.el" :mkdirp yes
    (use-package dashboard
      :config
      (dashboard-setup-startup-hook)
      (setq dashboard-center-content t
            dashboard-set-heading-icons t
            dashboard-set-file-icons t
            dashboard-banner-logo-title "WE’RE LEAN, WE’RE GREEN, AND WE’RE MEAN!"
            dashboard-items '((recents . 5))
            dashboard-startup-banner "~/.emacs.d/assets/mezemacs_logo_2.png"
            dashboard-image-banner-max-height 350)
      :init
      (add-hook 'dashboard-after-initialize-hook
                (lambda ()
                  (dashboard-insert-startupify-lists))))
  #+end_src
- Now we import to the main config
  #+begin_src emacs-lisp :tangle yes
    (load-file "~/.emacs.d/configs/dashboard_config_2.el")
  #+end_src
** Some modifications to the :q and :wq of evil mode
#+begin_src emacs-lisp :tangle yes
  (defun kill-current-buffer ()

    "kill the current buffer."
    (interactive)
    (kill-buffer (buffer-name)))
  (global-set-key [remap evil-quit] 'kill-current-buffer)

  (defun my-quit-emacs ()
    "Quit Emacs, or close current frame if there are multiple frames."
    (interactive)
    (if (eq window-system 'x)
        (if (cdr (frame-list))
            (delete-frame)
          (message "Can't quit Emacs with only one graphical frame"))
      (kill-emacs)))

  (global-set-key [remap evil-quit] 'kill-current-buffer)
  (global-set-key [remap evil-save-and-quit] 'my-quit-emacs)

#+end_src
** Config Which-key:
- Helps to find what keybind you trying to tap
  #+begin_src emacs-lisp :tangle yes
    (use-package which-key
    :ensure t
      :commands (which-key-mode)
      :hook ((after-init . which-key-mode)
	     (pre-command . which-key-mode))
      :config
      (setq which-key-idle-delay 1)
      :diminish which-key-mode)
  #+end_src
