MezEmacs.el
(setq custom-file (concat user-emacs-directory "./configs/custom_2.el"))
(when (file-exists-p custom-file)
  (load custom-file))

(setq custom-config "./configs/custom_2.el")
  (setq inhibit-startup-message t)
  (setq visual-line-mode t)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)
  (menu-bar-mode -1)
  (setq visible-bell 1)
  (global-display-line-numbers-mode)
  (setq display-line-numbers-type 'relative)

  (electric-pair-mode t)
  (setq-default indent-tabs-mode t)

  (defalias 'yes-or-no-p 'y-or-n-p)

  (prefer-coding-system 'utf-8)

(set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 140)
(set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 140)
(set-face-attribute 'variable-pitch nil :font "FiraCode Nerd Font" :height 140)

(load-file "~/.emacs.d/configs/tmnt_theme_color_2.el")

;; Initialize package sources
    (require 'package)

    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			    ("org" . "https://orgmode.org/elpa/")
			    ("elpa" . "https://elpa.gnu.org/packages/")))

    (package-initialize)
    (unless package-archive-contents
    (package-refresh-contents))

(use-package general
:ensure t
  :config
  (general-create-definer rune/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  (rune/leader-keys
    "t" '(:ignore t :which-key "toggles")
    ))

(use-package evil
    :demand t
    :bind (("<escape>" . keyboard-escape-quit))
    :init
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1))

(use-package evil-collection
:after evil
:config
(setq evil-want-integration t)
(evil-collection-init))

(use-package company
  :ensure t
  :init (global-company-mode)
  :config
  (setq company-selection-wrap-around t)
  (setq company-idle-delay 0.60)
  (setq company-minimum-prefix-length 1)
  (setq company-require-match nil)
  (setq company-tooltip-align-annotations t)
  (setq company-tooltip-flip-when-above t)
  (setq company-tooltip-limit 10)
  (setq company-tooltip-minimum-width 50)
  (setq company-tooltip-minimum-height 10)
  (setq company-dabbrev-downcase nil))

(defun my-company-tab-or-complete ()
  (interactive)
  (if (eq last-command 'company-complete-selection)
      (company-complete-selection)
    (if (eq company-common (car company-candidates))
        (company-complete-selection)
      (company-select-next))))

(defun my-company-backtab-or-complete ()
  (interactive)
  (if (eq last-command 'company-complete-selection)
      (company-complete-selection)
    (if (eq company-common (car (last company-candidates)))
        (company-complete-selection)
      (company-select-previous))))

(define-key company-active-map (kbd "TAB") 'my-company-tab-or-complete)
(define-key company-active-map (kbd "<tab>") 'my-company-tab-or-complete)
(define-key company-active-map (kbd "S-TAB") 'my-company-backtab-or-complete)
(define-key company-active-map (kbd "<backtab>") 'my-company-backtab-or-complete)

(use-package company-quickhelp
  :ensure t
  :after company
  :config
  (company-quickhelp-mode 1))

(defun my-disable-company-mode-in-python ()
  "Desativa o Company Mode no modo Python."
  (when (eq major-mode 'python-mode)
    (company-mode -1))
  (when (not (eq major-mode 'python-mode))
    (company-mode 1)))

(add-hook 'after-change-major-mode-hook 'my-disable-company-mode-in-python)

;; (setq gc-cons-threshold most-positive-fixnum)
;; (add-hook 'emacs-startup-hook
;;           (lambda ()
;;             (setq gc-cons-threshold (expt 2 23)))

(load-file "~/.emacs.d/configs/dashboard_config_2.el")

(defun kill-current-buffer ()

  "kill the current buffer."
  (interactive)
  (kill-buffer (buffer-name)))
(global-set-key [remap evil-quit] 'kill-current-buffer)

(defun my-quit-emacs ()
  "Quit Emacs, or close current frame if there are multiple frames."
  (interactive)
  (if (eq window-system 'x)
      (if (cdr (frame-list))
          (delete-frame)
        (message "Can't quit Emacs with only one graphical frame"))
    (kill-emacs)))

(global-set-key [remap evil-quit] 'kill-current-buffer)
(global-set-key [remap evil-save-and-quit] 'my-quit-emacs)

(use-package which-key
:ensure t
  :commands (which-key-mode)
  :hook ((after-init . which-key-mode)
	 (pre-command . which-key-mode))
  :config
  (setq which-key-idle-delay 1)
  :diminish which-key-mode)

(use-package ivy
:ensure t
    :diminish
