MezEmacs.org
** Config ivy and adjacent packages
- ivy:
  - improve file and directory searcch in the mini-buffer.
    #+begin_src emacs-lisp :tangle yes
      (use-package ivy
      :ensure t
	  :diminish
	  :bind (:map ivy-minibuffer-map
		      ("TAB" . ivy-alt-done)
		      ("C-l" . ivy-alt-done)
		      ("C-j" . ivy-next-line)
		      ("C-k" . ivy-previous-line)
		      :map ivy-switch-buffer-map
		      ("C-k" . ivy-previous-line)
		      ("C-l" . ivy-done)
		      ("C-d" . ivy-switch-buffer-kill)
		      :map ivy-reverse-i-search-map
		      ("C-k" . ivy-previous-line)
		      ("C-d" . ivy-reverse-i-search-kill))
	  :config
	  (ivy-mode 1))
    #+end_src
- Ivy rich:
  - Improve the ivy experience, enhance its aesthetics, and display additional information
    #+begin_src emacs-lisp :tangle yes
      (require 'ivy-rich)
      (ivy-rich-mode 1)
      (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
    #+end_src
- Counsel
  - Make the search in emacs even better. Counsel is make up on ivy
    #+begin_src emacs-lisp :tangle yes
      (use-package counsel
      :ensure t
	:bind (("C-x C-b" . 'counsel-switch-buffer)
	       :map minibuffer-local-map
	       ("C-r" . 'counsel-minibuffer-history))
	:config
	(counsel-mode 1))
    #+end_src
- ivy-perscient:
  - Enhance command suggestions and search based on you previous interactions
    #+begin_src emacs-lisp :tangle yes
      (use-package ivy-prescient
      :ensure t
	:after counsel
	:custom
	(ivy-prescient-enable-filtering nil)
	:config
	(ivy-prescient-mode 1))
    #+end_src
- ivy-posframe:
  - Floating ivy.
    #+begin_src emacs-lisp :tangle yes
      (require 'ivy-posframe)
      (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display)))
      (set-face-attribute 'ivy-posframe nil :foreground "white" :background "#301934")
      (setq ivy-posframe-hide-minibuffer t)
      (ivy-posframe-mode 1)
    #+end_src
** Config helpful:
- Display documentation, helps with searching, and answers questions about thing you need, such as searching for the commands you want to use.
  #+begin_src emacs-lisp :tangle yes
    (use-package helpful
      :custom
      (counsel-describe-function-function #'helpful-callable)
      (counsel-describe-variable-function #'helpful-variable)
      :bind
      ([remap describe-function] . counsel-descbinds-function)
      ([remap describe-command] . helpful-command)
      ([remap describe-variable] . counsel-describe-variable)
      ([remap describe-key] . helpful-key))
  #+end_src
** Config Eshell
- Eshell is the emacs shell, simulates shells like bash
#+begin_src emacs-lisp :tangle "~/.emacs.d/configs/eshell_config_2.el" :mkdirp yes
      (defun efs/configure-eshell ()
	;; Save command history when commands are entered
	(add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

	;; Truncate buffer for performance
	(add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

	;; Bind some useful keys for evil-mode
	(evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
	(evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
	(evil-normalize-keymaps)

	(setq eshell-history-size         10000
	      eshell-buffer-maximum-lines 10000
	      eshell-hist-ignoredups t
	      eshell-scroll-to-bottom-on-input t))

      (use-package eshell-git-prompt
  :ensure t)

      (use-package eshell
  :ensure t
	:hook (eshell-first-time-mode . efs/configure-eshell)
	:config

	(with-eval-after-load 'esh-opt
	  (setq eshell-destroy-buffer-when-process-dies t)
	  (setq eshell-visual-commands '("htop" "zsh" "vim")))

	(eshell-git-prompt-use-theme 'powerline))

      (setq eshell-ls-use-ls-dired t)
      (add-hook 'eshell-mode-hook
		(lambda ()
		  (eshell-ls-register-ext-dir ".")
		  (define-key eshell-mode-map (kbd "C-l") 'eshell-clear-buffer)
		  (define-key eshell-mode-map (kbd "C-d") 'eshell-send-input)))

    (defun my/set-eshell-foreground ()
      (setq-local face-remapping-alist '((default (:foreground "white")))))
    (add-hook 'eshell-mode-hook 'my/set-eshell-foreground)

      (add-hook 'eshell-mode-hook 'my/disable-line-numbers)
  (defun my/disable-line-numbers ()
    (display-line-numbers-mode -1))

#+end_src

#+RESULTS:
: my/disable-line-numbers

- Importing eshell to the main config
  #+begin_src emacs-lisp :tangle yes
    (defun my-eshell-config ()
      (setq eshell_config "~/.emacs.d/configs/eshell_config.el")
      (load eshell_config))

    (add-hook 'eshell-mode-hook #'my-eshell-config)
  #+end_src
** Config no-littering:
- helps maintain an organized emacs directory. Temporary files and backups are saved in specific locations.
  #+begin_src emacs-lisp :tangle yes
    (use-package no-littering
    :ensure t)
    (setq auto-save-file-name-transforms
	  `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  #+end_src
** Config Dired & adjacent packages:
- Dired:
  - It is Emacs' mode for navigating and managing directories and files in the file system.
    #+begin_src emacs-lisp :tangle yes
      (use-package dired
	:ensure nil
	:commands (dired dired-jump)
	:bind (("C-x C-j" . dired-jump))
	:custom ((dired-listing-switches "-agho --group-directories-first"))
	:config
	(evil-collection-define-key 'normal 'dired-mode-map
	  "h" 'dired-single-up-directory
	  "g" 'dired-single-buffer))
    #+end_src

    #+RESULTS:
    : dired-jump

- dired-single & dired-all-the-icons:
  - Enhances the functionality of the dired mode, allowing you to open directories in a single window, replacing the current buffer instead of opening a new window for each directory.
    #+begin_src emacs-lisp :tangle yes
      (use-package dired-single)

      (use-package all-the-icons-dired
        :hook (dired-mode . all-the-icons-dired-mode))
    #+end_src

    #+RESULTS:
    | dired-hide-dotfiles-mode | dired-extra-startup | all-the-icons-dired-mode |

- Dired-open & dired-hide-dotfiles:
  - Adds support for opening files directly from dired mode using external applications suitable for the file type.
    #+begin_src emacs-lisp :tangle yes
      (use-package dired-open
	:config
	(setq dired-open-extensions '(("png" . "feh")
				      ("mkv" . "mpv"))))

      (use-package dired-hide-dotfiles
	:hook (dired-mode . dired-hide-dotfiles-mode)
	:config
	(evil-collection-define-key 'normal 'dired-mode-map
	  "H" 'dired-hide-dotfiles-mode))
    #+end_src

    #+RESULTS:
    | dired-hide-dotfiles-mode | dired-extra-startup | all-the-icons-dired-mode |

** Config Centered window & cursor:
#+begin_src emacs-lisp :tangle yes
  ;;;;; center ;;;;;;
  (use-package centered-window
    :ensure t
    :config
    (centered-window-mode t))

  (use-package centered-cursor-mode
  :ensure t
    :demand
    :config
    (global-centered-cursor-mode))
#+end_src
** Config rainbows mode:
- Rainbow mode:
  - All written or hexadecimal color codes are displayed in the corresponding color they represent.
    #+begin_src emacs-lisp :tangle yes
      (use-package rainbow-mode
      :ensure t
	:hook ((prog-mode . rainbow-mode)
	       (after-init . rainbow-mode))
	:config
	(setq rainbow-identfiers-choose-face-function 'rainbow-identifers-cie-l*a*b*-choose-face
	      rainbow-identifiers-cie-l*a*b*-lightness 45
	      rainbow-identifiers-cie-l*a*b*-saturation 70
	      rainbow-identifiers-rgb-face t))
    #+end_src
- Rainbow delimiters:
  - Colors the [({})] symbols to make it easier to visualize the level you're at and which brackets you have opened and may have forgotten to close.
   #+begin_src emacs-lisp :tangle yes
     (use-package rainbow-delimiters
     :ensure t
       :hook ((prog-mode . rainbow-delimiters-mode)
	      (org-mode . rainbow-delimiters-mode))
       :custom-face
       (rainbow-delimiters-depth-1-face ((t (:foreground "#92c48f"))))
       (rainbow-delimiters-depth-2-face ((t (:foreground "#f0a000"))))
       (rainbow-delimiters-depth-3-face ((t (:foreground "#ffdf00"))))
       (rainbow-delimiters-depth-4-face ((t (:foreground "#40ff00"))))
       (rainbow-delimiters-depth-5-face ((t (:foreground "#00f0a0"))))
       (rainbow-delimiters-depth-6-face ((t (:foreground "#0080ff"))))
       (rainbow-delimiters-depth-7-face ((t (:foreground "#bf00ff"))))
       (rainbow-delimiters-depth-8-face ((t (:foreground "#ff00bf"))))
       (rainbow-delimiters-depth-9-face ((t (:foreground "#ff0080")))))
    #+end_src

    #+RESULTS:
    | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | org-bullets-mode | efs/org-mode-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | my-disable-line-numbers | my-org-config | rainbow-delimiters-mode |

** Config Transparent emacs
- Transparency configs:
  #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/transparency_config_2.el" :mkdirp yes
    ;; Define functions to increase/decrease transparency by 5
    (defun transparency-increase ()
      (interactive)
      (let* ((alpha-list '((100 100) (85 65) (70 50) (55 35) (40 20) (25 10) (10 5) (0 0)))
             (current-alpha (or (cdr (assoc 'alpha (frame-parameters))) (cons 100 100)))
             (closest (car alpha-list)))
        (dolist (a alpha-list)
          (when (> (abs (- (car a) (car current-alpha))) (abs (- (car closest) (car current-alpha)))))
          (setq closest a))
        (set-frame-parameter (selected-frame) 'alpha closest)))

    (defun transparency-decrease ()
      (interactive)
      (let* ((alpha-list '((100 100) (85 65) (70 50) (55 35) (40 20) (25 10) (10 5) (0 0)))
             (current-alpha (or (cdr (assoc 'alpha (frame-parameters))) (cons 100 100)))
             (closest (car alpha-list)))
        (dolist (a (reverse alpha-list))
          (when (> (abs (- (car a) (car current-alpha))) (abs (- (car closest) (car current-alpha)))))
          (setq closest a))
        (set-frame-parameter (selected-frame) 'alpha closest)))

    ;; Define function to set transparency to a specific value
    (defun transparency-set (value)
      (interactive "nTransparency Value (0-100): ")
      (set-frame-parameter (selected-frame) 'alpha (cons value value)))



    ;; Set keybindings for transparency functions
    (global-set-key (kbd "C-c C-t +") 'transparency-increase)
    (global-set-key (kbd "C-c C-t -") 'transparency-decrease)
    (global-set-key (kbd "C-c C-t =") 'transparency-set)
  #+end_src
- Importing the config to the main file
  #+begin_src emacs-lisp :tangle yes
    (load-file "~/.emacs.d/configs/transparency_config_2.el")
  #+end_src
