MezEmacs.el
    :bind (:map ivy-minibuffer-map
		("TAB" . ivy-alt-done)
		("C-l" . ivy-alt-done)
		("C-j" . ivy-next-line)
		("C-k" . ivy-previous-line)
		:map ivy-switch-buffer-map
		("C-k" . ivy-previous-line)
		("C-l" . ivy-done)
		("C-d" . ivy-switch-buffer-kill)
		:map ivy-reverse-i-search-map
		("C-k" . ivy-previous-line)
		("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

(require 'ivy-rich)
(ivy-rich-mode 1)
(setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

(use-package counsel
:ensure t
  :bind (("C-x C-b" . 'counsel-switch-buffer)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history))
  :config
  (counsel-mode 1))

(use-package ivy-prescient
:ensure t
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (ivy-prescient-mode 1))

(require 'ivy-posframe)
(setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display)))
(set-face-attribute 'ivy-posframe nil :foreground "white" :background "#301934")
(setq ivy-posframe-hide-minibuffer t)
(ivy-posframe-mode 1)

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-descbinds-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(defun my-eshell-config ()
  (setq eshell_config "~/.emacs.d/configs/eshell_config.el")
  (load eshell_config))

(add-hook 'eshell-mode-hook #'my-eshell-config)

(use-package no-littering
:ensure t)
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "g" 'dired-single-buffer))

(use-package dired-single)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :config
  (setq dired-open-extensions '(("png" . "feh")
				("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

;;;;; center ;;;;;;
(use-package centered-window
  :ensure t
  :config
  (centered-window-mode t))

(use-package centered-cursor-mode
:ensure t
  :demand
  :config
  (global-centered-cursor-mode))

(use-package rainbow-mode
:ensure t
  :hook ((prog-mode . rainbow-mode)
	 (after-init . rainbow-mode))
  :config
  (setq rainbow-identfiers-choose-face-function 'rainbow-identifers-cie-l*a*b*-choose-face
	rainbow-identifiers-cie-l*a*b*-lightness 45
	rainbow-identifiers-cie-l*a*b*-saturation 70
	rainbow-identifiers-rgb-face t))

(use-package rainbow-delimiters
:ensure t
  :hook ((prog-mode . rainbow-delimiters-mode)
	 (org-mode . rainbow-delimiters-mode))
  :custom-face
  (rainbow-delimiters-depth-1-face ((t (:foreground "#92c48f"))))
  (rainbow-delimiters-depth-2-face ((t (:foreground "#f0a000"))))
  (rainbow-delimiters-depth-3-face ((t (:foreground "#ffdf00"))))
  (rainbow-delimiters-depth-4-face ((t (:foreground "#40ff00"))))
  (rainbow-delimiters-depth-5-face ((t (:foreground "#00f0a0"))))
  (rainbow-delimiters-depth-6-face ((t (:foreground "#0080ff"))))
  (rainbow-delimiters-depth-7-face ((t (:foreground "#bf00ff"))))
  (rainbow-delimiters-depth-8-face ((t (:foreground "#ff00bf"))))
  (rainbow-delimiters-depth-9-face ((t (:foreground "#ff0080")))))

(load-file "~/.emacs.d/configs/transparency_config_2.el")

;;;;; org mode ;;;;;
