MezEmacs.org
** Config Org Mode
- Configurations for Org mode
  #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/org_config_2.el" :mkdirp yes
    (defun efs/org-font-setup ()
      ;; Replace list hyphen with dot
      (font-lock-add-keywords 'org-mode
			      '(("^ *\\([-]\\) "
				 (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
      (add-hook 'org-mode-hook 'visual-line-mode)
      ;; Set faces for heading levels
      (dolist (face '((org-level-1 . 1.2)
		      (org-level-2 . 1.1)
		      (org-level-3 . 1.05)
		      (org-level-4 . 1.0)
		      (org-level-5 . 1.1)
		      (org-level-6 . 1.1)
		      (org-level-7 . 1.1)
		      (org-level-8 . 1.1)))
	(set-face-attribute (car face) nil
			    :font "FiraCode Nerd Font" :weight 'regular :height (* 10 (cdr face)) ))

      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
    (defun efs/org-mode-setup ()
      (org-indent-mode)
      (variable-pitch-mode 1)
      (visual-line-mode 1))

    (use-package org
    :ensure t
      :hook (org-mode . efs/org-mode-setup)
      :config
      (setq org-ellipsis " ▾"))

    (use-package org-bullets
    :ensure t
      :after org
      :hook (org-mode . org-bullets-mode)
      :custom
      (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp :tangle yes . t)
       (python . t)
       (ein . t)))
    (push '("conf-unix" . conf-unix) org-src-lang-modes)
    ;; This is needed as of Org 9.2
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp :tangle yes"))
    (add-to-list 'org-structure-template-alist '("py" . "src python :tangle yes :results output"))
    (add-to-list 'org-structure-template-alist '("ein" . "src ein-python :session localhost"))
    ;; Automatically tangle our Emacs.org config file when we save it
    (defun efs/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
			  (expand-file-name "~/Projects/Code/emacs-from-scratch/Emacs.org"))
	;; Dynamic scoping to the rescue
	(let ((org-confirm-babel-evaluate nil))
	  (org-babel-tangle))))
    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))


    (custom-set-faces
     '(org-block-begin-line
       ((t (
	    :box '(:line-width 3 :color "purple")
	    :foreground "purple" :background "#46005f" :extend t))))
     '(org-block
       ((t (:background "#301934" :extend t))))
     '(org-block-end-line
       ((t (
	    :box '(:line-width 3 :color "purple")
	    :foreground "purple" :background "#46005f" :extend t))))
     )

  #+end_src

  #+RESULTS:

- Importing org config to the main file
  #+begin_src emacs-lisp :tangle yes
    ;;;;; org mode ;;;;;
    (defun my-org-config ()
      (setq orgConfig-file "~/.emacs.d/configs/org_config_2.el")
      (load orgConfig-file))
    (add-hook 'org-mode-hook #'my-org-config)
  #+end_src
** Config Doom modeline
- Let the modeline better
  #+begin_src emacs-lisp :tangle yes
    ;; Doom modeline
    (use-package all-the-icons)
    (use-package nerd-icons)
    (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
  #+end_src
** Config Golden ration
- Give more space to the in focus buffer
  #+begin_src emacs-lisp :tangle yes
    (require 'golden-ratio)
    (golden-ratio-mode 1)
  #+end_src
** Config Treemacs
- Configuration have a nice directory tree by the side
  #+begin_src emacs-lisp :tangle yes
    ;;;;; treemacs
    (use-package treemacs
      :ensure t
      :config
      (with-eval-after-load 'treemacs
        (treemacs-project-follow-mode t))
      (setq tree-macs-show-icons t) ; Enable icons in the tree view
      (setq tree-macs-width 30) ; Set the width of the tree view
  
      ;; Customize keybindings (optional)
      (global-set-key (kbd "C-c t") 'tree-macs-toggle)

      ;; Define custom file filter
      (setq tree-macs-file-filters
            '(;; Exclude some file types
              (not (name . "\\.git"))
              (not (name . "\\.DS_Store"))
              (not (name . "\\.pyc")))))
  #+end_src
** Config My python
- Configuration for python. Heare we have the packages:
  - elpy:
    - All the configuration for run python in emacs.
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
      (use-package elpy
        :ensure t
        :init
        (elpy-enable)
        :config
        (setq python-shell-interpreter "python")
        (setq elpy-rpc-python-command "python")
        (add-hook 'python-mode-hook 'pyvenv-mode))

    #+end_src
  - pyvenv:
    - Package to create and use py venvs.
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
      ;; Use 'pyvenv' for virtualenv management
      (use-package pyvenv
        :ensure t
        :hook (python-mode . pyvenv-mode))
    #+end_src
  - blacken:
    - Too for code formatation.
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
      ;; Use 'black' for code formatting
      (use-package blacken
        :ensure t
        :hook (python-mode . blacken-mode))

    #+end_src
  - Flycheck:
    - Verification of code error and warnings in real time.
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
      ;; Enable 'flycheck' for syntax checking
      (use-package flycheck
        :ensure t
        :init (global-flycheck-mode))
    #+end_src
  - Python:
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
      (use-package python
        :ensure t
        :config
        (add-hook 'python-mode-hook
                  (lambda ()
                    (local-set-key (kbd "M-.") 'jedi:goto-definition))))
    #+end_src
  - Jedi:
    - Libary for python code completions.
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
(use-package jedi
  :ensure t
  :init
  (setq jedi:use-shortcuts t)
  :config
  (setq ac-delay 0.1) ; Configuração para auto-complete instantâneo
  (setq eldoc-idle-delay 0.1) ; Configuração para acelerar a exibição das informações
  (add-hook 'python-mode-hook 'jedi:setup)
  (eval-after-load 'jedi-core
    '(progn
       ;; (setq jedi-completion-function 'company-jedi) ; Use Company para Jedi completions
       (define-key jedi-mode-map (kbd "M-.") 'jedi:goto-definition)
       (define-key jedi-mode-map (kbd "M-,") 'jedi:goto-definition-pop-marker)
       (define-key jedi-mode-map (kbd "M-r") 'jedi:show-doc)
       (define-key jedi-mode-map (kbd "M-*") 'jedi:pop-to-definition-pop-marker))))
    #+end_src
  - IPy Kernel:
    #+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
      ;; ;; Us e IPython if available
      (when (executable-find "ipython")
        (setq python-shell-interpreter "ipython")
        (setq python-shell-interpreter-args "-i --simple-prompt"))
    #+end_src
- Function to disable company mode in jedi-mode
  #+begin_src emacs-lisp :tangle yes

       (defun my-disable-company-mode-in-python ()
         "Desativa o Company Mode no modo Python."
         (when (eq major-mode 'python-mode)
           (company-mode -1))
         (when (not (eq major-mode 'python-mode))
           (company-mode 1)))

       (add-hook 'after-change-major-mode-hook 'my-disable-company-mode-in-python)
    
       #+end_src
- Emacs IPython Notebook:
#+begin_src emacs-lisp :tangle "~/.emacs.d/configs/python_config_2.el" :mkdirp yes
        (use-package ein
        :ensure t)
#+end_src
- Now we import the config for the main file
  #+begin_src emacs-lisp :tangle yes
    (defun my-python-config ()
      (setq pythonConfig-file "~/.emacs.d/configs/python_config.el")
      (load pythonConfig-file))
    (add-hook 'python-mode-hook #'my-python-config)
  #+end_src
** Function to not disable number collumn for some modes
#+begin_src emacs-lisp :tangle yes

  (defun my-disable-line-numbers ()
    "Disable line numbers."
    (display-line-numbers-mode 0))



  (add-hook 'org-mode-hook 'my-disable-line-numbers)
  (add-hook 'term-mode-hook 'my-disable-line-numbers)
  (add-hook 'shell-mode-hook 'my-disable-line-numbers)
  (add-hook 'eshell-mode-hook 'my-disable-line-numbers)
  (add-hook 'dashboard-mode-hook 'my-disable-line-numbers)
#+end_src
** Function to display the startup time
#+begin_src emacs-lisp :tangle yes
  (defvar my-init-start-time (current-time) "Time when init.el was started")
  (defun display-start-up-echo-area-message ()
    (message "Emacs Initialized in %.2fs: " (float-time (time-subtract (current-time) my-init-start-time))))
#+end_src
