MezEmacs.el
(defun my-org-config ()
  (setq orgConfig-file "~/.emacs.d/configs/org_config_2.el")
  (load orgConfig-file))
(add-hook 'org-mode-hook #'my-org-config)

;; Doom modeline
(use-package all-the-icons)
(use-package nerd-icons)
(use-package doom-modeline
:init (doom-modeline-mode 1)
:custom ((doom-modeline-height 15)))

(require 'golden-ratio)
(golden-ratio-mode 1)

;;;;; treemacs
(use-package treemacs
  :ensure t
  :config
  (with-eval-after-load 'treemacs
    (treemacs-project-follow-mode t))
  (setq tree-macs-show-icons t) ; Enable icons in the tree view
  (setq tree-macs-width 30) ; Set the width of the tree view

  ;; Customize keybindings (optional)
  (global-set-key (kbd "C-c t") 'tree-macs-toggle)

  ;; Define custom file filter
  (setq tree-macs-file-filters
        '(;; Exclude some file types
          (not (name . "\\.git"))
          (not (name . "\\.DS_Store"))
          (not (name . "\\.pyc")))))

(defun my-disable-company-mode-in-python ()
  "Desativa o Company Mode no modo Python."
  (when (eq major-mode 'python-mode)
    (company-mode -1))
  (when (not (eq major-mode 'python-mode))
    (company-mode 1)))

(add-hook 'after-change-major-mode-hook 'my-disable-company-mode-in-python)

(defun my-python-config ()
  (setq pythonConfig-file "~/.emacs.d/configs/python_config.el")
  (load pythonConfig-file))
(add-hook 'python-mode-hook #'my-python-config)

(defun my-disable-line-numbers ()
  "Disable line numbers."
  (display-line-numbers-mode 0))



(add-hook 'org-mode-hook 'my-disable-line-numbers)
(add-hook 'term-mode-hook 'my-disable-line-numbers)
(add-hook 'shell-mode-hook 'my-disable-line-numbers)
(add-hook 'eshell-mode-hook 'my-disable-line-numbers)
(add-hook 'dashboard-mode-hook 'my-disable-line-numbers)

(defvar my-init-start-time (current-time) "Time when init.el was started")
(defun display-start-up-echo-area-message ()
  (message "Emacs Initialized in %.2fs: " (float-time (time-subtract (current-time) my-init-start-time))))
